Q1 Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [27]:
import pandas as pd
d = {'A':["John","Kelly","Ryan","Holt"],'B':[23,45,67,32],'C':['Male','Female','Male','Male']}
df = pd.DataFrame(d)
df

       A   B       C
0   John  23    Male
1  Kelly  45  Female
2   Ryan  67    Male
3   Holt  32    Male

In [28]:
#making new index for the dataframe
l = [x for x in range(1,2*(len(df))+1) if x%2==1] 
df['index'] = l
df.set_index('index',inplace=True)
df

           A   B       C
index
1       John  23    Male
3      Kelly  45  Female
5       Ryan  67    Male
7       Holt  32    Male

# ----------------------------------------------------------------------------------------------------------

Q2 You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [32]:
d = {'Values':[10,20,30,40,50]}
df = pd.DataFrame(d)
sum = df[:3].sum()
sum

Values    60
dtype: int64

# ---------------------------------------------------------------------------------------------------------

Q3 Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [33]:
d = {'Text':['Hi everyone','My Name is Johnny John','I am 42 years old','and I will be working here for next 2 months']}
df = pd.DataFrame(d)
df

                                           Text
0                                   Hi everyone
1                        My Name is Johnny John
2                             I am 42 years old
3  and I will be working here for next 2 months

In [39]:
def func(x):
    l = x.split(' ')
    return len(l)

df['word_count'] = df['Text'].apply(func)
df

                                           Text  word_count
0                                   Hi everyone           2
1                        My Name is Johnny John           5
2                             I am 42 years old           5
3  and I will be working here for next 2 months          10

# -----------------------------------------------------------------------------------------------------

Q4. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [40]:
d = {'Email':['username@gmail.com','johnrt23@yahoo.com','nest45@hotmail.com']}
df = pd.DataFrame(d)
df

                Email
0  username@gmail.com
1  johnrt23@yahoo.com
2  nest45@hotmail.com

In [45]:
df['Username'] = [x[:x.index('@')] for x in d['Email']]
df

                Email  Username
0  username@gmail.com  username
1  johnrt23@yahoo.com  johnrt23
2  nest45@hotmail.com    nest45

# -------------------------------------------------------------------------------------------------------

Q5. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

   A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows

In [48]:
d = {'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
df = pd.DataFrame(d)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [52]:
df_filter = df[(df['A']>5) & (df['B']<10)]
df_filter

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2